In [35]:
import pandas as pd

In [36]:
score = pd.read_csv('score.csv',index_col='과목', encoding = 'cp949')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

##### 학급별 총계

In [37]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

##### 학급별 점수 순위

In [38]:
score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

##### 과목별 합계 구하기

In [39]:
score.sum(axis = 1)

과목
파이썬    201
DB     282
자바     253
크롤링    298
Web    163
dtype: int64

#### 과목별 합계를 DataFrame에 추가하기

In [40]:
score['합계'] = score.sum(axis = 1)
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

##### 과목별 평균을 계산하여 column을 추가해보자

In [41]:
score['평균'] = score.loc[:,:'4반'].mean(axis=1)
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

##### max(), min() 함수

In [42]:
print(score.max())

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [43]:
print(score.min())

1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

In [44]:
print(score.max(axis=1))

과목
파이썬    201.0
DB     282.0
자바     253.0
크롤링    298.0
Web    163.0
dtype: float64

In [45]:
print(score.min(axis=1))

과목
파이썬    39.0
DB     45.0
자바     45.0
크롤링    40.0
Web    11.0
dtype: float64

#### 전체 반에서 과목별 가장 높은 점수만 뽑아와라

In [46]:
maxArr = score.loc[:'Web',:'4반'].max(axis=1)
maxArr

과목
파이썬    73
DB     92
자바     92
크롤링    92
Web    79
dtype: int64

#### 전체 반에서 과목별 가장 낮으면 점수만 뽑아와라

In [47]:
minArr = score.loc[:'Web',:'4반'].min(axis=1)
minArr

과목
파이썬    39
DB     45
자바     45
크롤링    40
Web    11
dtype: int64

##### 과목별 가장 큰 값과 작은 값의 차이를 구하시오

In [48]:
maxArr - minArr

과목
파이썬    34
DB     47
자바     47
크롤링    52
Web    68
dtype: int64

In [49]:
score

     1반  2반  3반  4반   합계     평균
과목
파이썬  45  44  73  39  201  50.25
DB   76  92  45  69  282  70.50
자바   47  92  45  69  253  63.25
크롤링  92  81  85  40  298  74.50
Web  11  79  47  26  163  40.75

In [55]:
score.drop(['합계','평균'], axis=1)

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

- df.apply(func, axis = 0 or 1)
- 행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용!
- pandas의 객체에 다른 라이브러리 함수를 적용하는 방법
- pandas객체에 열 혹은 행에 대해 함수를 적용하게 해주는 함수

In [57]:
data_dic = {'A' : [1,3,3,4,4], 'B' : [1,2,2,3,3], 'C' : [1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

##### apply를 사용하여 각 열에 대해 어떤 값이 얼마나 사용되었는지 알아보자.

In [58]:
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

- fillna()
- 결측치(NaN)를 원하는 값으로 바꾸는 기능

In [59]:
df4.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [62]:
ages = [0,2,10,21,23,37,31,61,20,41,32,100]
bins = [0,15,25,35,60,99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [63]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [64]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

##### age를 데이터프레임으로 만들어라

In [68]:
ageArr = pd.DataFrame(ages, columns = ['ages'])
ageArr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

##### 각 연령에 맞게 카테고리를 추가하자.

In [69]:
ageArr['age_cat'] = cats
ageArr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

- value_counts 함수
- 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 세는 기능

##### 카테고리별로 나이 개수를 확인해보자.

In [70]:
ageArr['age_cat'].value_counts()

청년      3
미성년자    2
중년      2
장년      2
노년      1
Name: age_cat, dtype: int64

#### DataFrame 병합

##### concat함수

In [72]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3'],
                    'C' : ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']},
                   index = [0,1,2,3])
df2 = pd.DataFrame({'A' : ['A4', 'A5', 'A6', 'A7'],
                    'B' : ['B4', 'B5', 'B6', 'B7'],
                    'C' : ['C4', 'C5', 'C6', 'C7'],
                    'D' : ['D4', 'D5', 'D6', 'D7']},
                   index = [4,5,6,7])
df3 = pd.DataFrame({"A" : ["A8", "A9", "A10", "A11"],
                    "B" : ["B8", "B9", "B10", "B11"],
                    "C" : ["C8", "C9", "C10", "C11"],
                    "D" : ["D8", "D9", "D10", "D11"]},
                   index = [8,9,10,11])

In [73]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

##### keys 속성 부여 시 다중 index 가 된다.

In [74]:
result = pd.concat([df1,df2,df3], keys = ['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

##### 다중 index 확인

In [75]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [76]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

##### 행 방향으로 병합하기

In [78]:
df4 = pd.DataFrame({"B" : ["B2", "B3", "B6", "B7"],
                    "D" : ["D2", "D3", "D6", "D7"],
                    "F" : ["F2", "F3", "F6", "F7"]},
                   index = [2,3,6,7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [84]:
result = pd.concat([df1,df4],axis = 1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [85]:
result = pd.concat([df1,df4],axis = 0)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

- concat 함수의 join속성
- Innerjoin
- Fulljoin(Outerjoin)

##### concat함수의 join속성

In [86]:
result = pd.concat([df1, df4], axis = 1, join = 'inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [87]:
result = pd.concat([df1, df4], axis = 0, join = 'inner')
result

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

- concat함수의 ignore_index 속성
- 기존 인덱스를 무시하고 새로운 인덱스 부여하는 기능

In [88]:
result = pd.concat([df1,df4], ignore_index = True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7